---
kind: method
id: M:Autodesk.Revit.DB.FailureMessage.GetAdditionalElements
source: html/4edd9544-1db3-2829-77c3-0e92dbd2f54c.htm
---
# Autodesk.Revit.DB.FailureMessage.GetAdditionalElements Method

Retrieves list of the additional reference elements for the failure.

## Syntax (C#)
```csharp
public ICollection<ElementId> GetAdditionalElements()
```

## Returns
The additional elements.